app/Controllers/Barang.php

SELECT *
FROM `ruangan`
---
    public function edit($kode_barang)
    {
        $data = [
            'title' => ' From Edit Barang',
            'validation' => \Config\Services::validation(),
            'ruangan' => $this->db->table('ruangan')->get()->getResultArray(),

SELECT *
FROM `barang`
---
    public function export()
    {
        $dataBarang = $this->db->table('barang')->get()->getResultArray();