app/Controllers/Peminjaman.php

    public function create()
    {
        $data = [
            'title' => ' From Peminjaman Barang',
            'validation' => \config\Services::validation(),
            'barang' => $this->db->table('barang')->get()->getResultArray(),
            'pegawai' => $this->db->table('pegawai')->get()->getResultArray()
---
SELECT *
FROM `barang`
SELECT *
FROM `pegawai`